<script>
	import Image from '$lib/Image.svelte';
	import Scene from '$lib/Scene.svelte';
	import Background from '$lib/Background.svelte';
	import Timeline from '$lib/Timeline.svelte';
	import Copyright from '$lib/Copyright.svelte';
	import Preview from '$lib/Preview.svelte';

	let scenes = $state();
</script>

<Background />

<div class="wrapper">
	{#if scenes}
		<Timeline values={[1220, 1240, 1241, 1242, 1251, 1257, 1263]} bind:bind={scenes} />
	{/if}

	<div class="scenes" bind:this={scenes}>
		<Preview
			title="Александр Невский"
			text="Великий князь Новгородский,<br>Великий князь Киевский,<br> Великий князь Владимирский"
		/>

		<!-- Nursery -->
		<Scene
			title="Детство"
			text="Александр был вторым сыном переяславль-залесского князя. В детстве Александр принял так называемый «княжеский постриг» в 10 лет. Князь построил множетсво укреплений для защиты торговой столицы Руси, а также часто помогал отцу в военных делах."
		>
			{#snippet img()}
				<Image url="art-1.png" />
			{/snippet}
		</Scene>

		<!-- Невская битва -->
		<Scene
			alternate={true}
			title="Невская &ensp;&ensp;&ensp;&ensp;&ensp; битва"
			text="Александр, узнав об прибытии шведских врагов, без запроса помощи из Владимира и даже без полного сбора ополчения, со своей дружиной и успевшими собраться отрядами новгородцев и ладожан атаковал шведский лагерь у устья Ижоры и одержал победу."
		>
			{#snippet img()}
				<Image url="art-2.png" />
			{/snippet}
		</Scene>

		<!-- Захват ливонцами Пскова -->
		<Scene
			title="Захват &ensp;&ensp;&ensp;&ensp;&ensp; ливонцами <br>Пскова"
			text="После ссоры с Новгородцами, Александря князя прогнали. Однако вскоре наступили страшные немецкие войны, посягающие на русскую землю. И вот тогда жители Новгорода попросили прощения у царя и позвали его на помощь, чтобы разбить немцев. Так и было."
		>
			{#snippet img()}
				<Image url="art-3.png" />
			{/snippet}
		</Scene>

		<!-- Ледовое побоище -->
		<Scene
			alternate={true}
			title="Ледовое &ensp;&ensp;&ensp;&ensp;&ensp; побоище"
			text="В истории военного искусства средних веков победа Александра Невского на Чудском озере имела большое значение: русское пешее войско окружило и разгромило рыцарскую конницу и отряды пеших кнехтов, задолго до того как в Западной Европе пехота научилась одерживать верх над рыцарями. Победа в этой битве поставила Александра Невского в ряд крупнейших военачальников своего времени. Агрессия немецких рыцарей на Русь была остановлена"
		>
			{#snippet img()}
				<Image url="art-4.png" />
			{/snippet}
		</Scene>

		<!-- Великое княжение -->
		<Scene
			title="Великое &ensp;&ensp;&ensp;&ensp;&ensp; княжение"
			text="К Александру Невскому в Новгород приехали два кардинала с буллой. По рассказу летописца, Александр Невский, посоветовавшись с мудрыми людьми, изложил всю историю Руси и в заключение сказал: «Си вся съведаем добре, а от вас учения не принимаем»."
		>
			{#snippet img()}
				<Image url="art-5.png" />
			{/snippet}
		</Scene>

		<!-- Дипломатия с Ордой -->
		<Scene
			alternate={true}
			title="Диполматия <br> с &ensp;&ensp;&ensp;&ensp;&ensp; Ордой"
			text="Александр ездил в Орду «чтить» ханского наместника Улавчия, а в 1259 году, угрожая татарским погромом, добился от новгородцев согласия на перепись и дань («тамги и десятины»). Александр Невский, за всю жизнь не проигравший ни одной битвы, проявил талант полководца и дипломата, заключив мир с наиболее сильным (но при этом более веротерпимым) врагом — Золотой Ордой — и отразив нападение с Запада"
		>
			{#snippet img()}
				<Image url="art-6.png" />
			{/snippet}
		</Scene>

		<!-- Смерть -->
		<Scene
			title="Смерть"
			text="Приняв схиму под именем Алексия, он скончался 14 ноября (есть две версии о месте смерти — в Городце Волжском или в Городце Мещёрском). Митрополит Кирилл возвестил народу во Владимире о его смерти словами: «Чада моя милая, разумейте, яко заиде солнце Русской земли», и все с плачем воскликнули: «Уже погибаем!»"
		>
			{#snippet img()}
				<Image url="art-7.png" />
			{/snippet}
		</Scene>

		<Copyright />
	</div>
</div>

<style>
	.wrapper {
		display: flex;
		gap: 40px;
		width: 100%;
	}
	.scenes {
		display: flex;
		flex-direction: column;
		flex-grow: 1;
		user-select: none;
		-webkit-user-select: none;
		-moz-user-select: none;
		overflow-y: scroll;
		height: 100vh;
		padding-left: 300px;
		scroll-snap-type: y mandatory;
	}
</style>
